app/Controllers/Home.php

    public function getUsers(){
        $userModel = new \App\Models\UserModel();

        return json_encode($userModel->findAll());
---
SELECT *
FROM `users`

    public function addUser(){
        $name = $this->request->getPost('name');
        $email = $this->request->getPost('email');

        $data = [
            'name' => $name,
            'email'    => $email,
        ];
        $userModel = new \App\Models\UserModel();
        // Inserts data and returns inserted row's primary key
         return $userModel->insert($data);
---
INSERT INTO `users` (`email`) VALUES ('simamora@gmail.com')

    public function deleteUser(){
        $userModel = new \App\Models\UserModel();
        $id = $this->request->getPost('id');

        return $userModel->where('id', $id)->delete();
---
DELETE FROM `users`
WHERE `id` = '1'